; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	thermograph4 - mode
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph4)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph4)
	(supports instrument7 spectrograph3)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
	(supports instrument9 thermograph4)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star1)
	(supports instrument10 spectrograph3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star1)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 GroundStation3)
	(have_image Star6 spectrograph3)
	(have_image Planet7 spectrograph0)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph3)
	(have_image Star10 spectrograph3)
	(have_image Planet11 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star2 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star2)
   goals met: 0 of 9
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 9
3. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 9
4. (turn_to satellite3 planet7 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet7)
   goals met: 0 of 9
5. (take_image satellite3 planet7 instrument7 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 1 of 9
6. (turn_to satellite3 planet11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet11)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 9
8. (take_image satellite3 planet11 instrument7 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 3 of 9
9. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 9
10. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 3 of 9
11. (turn_to satellite2 star8 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star8)
   goals met: 3 of 9
12. (take_image satellite2 star8 instrument3 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 4 of 9
13. (turn_to satellite2 groundstation4 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation4)
   goals met: 5 of 9
14. (turn_to satellite3 star10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star10)
   goals met: 5 of 9
15. (take_image satellite3 star10 instrument7 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 6 of 9
16. (turn_to satellite3 star6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star6)
   goals met: 6 of 9
17. (take_image satellite3 star6 instrument7 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 7 of 9
18. (turn_to satellite3 star9 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star9)
   goals met: 7 of 9
19. (take_image satellite3 star9 instrument7 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 8 of 9
20. (turn_to satellite3 groundstation3 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation3)
   goals met: 9 of 9
